In [15]:
import pandas as pd

In [16]:
df = pd.read_csv('./data/Iris.csv')

In [17]:
#print the first five rows

df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [18]:
#print the last five rows
df.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [19]:
# print the columns names
print(df.columns)

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [20]:
# check the index
print(df.index)

RangeIndex(start=0, stop=150, step=1)

In [21]:
# change the column names 
# way 1
df.columns = ['id', 'sepal_lengthcm','sepal_widthcm','petal_lengthcm','petal_widthcm','species']

# way2
df.rename(columns={'Id':'id',
                   'SepalLengthCm':'sepal_lengthcm',
                   'SepalWidthCm':'sepal_widthcm',
                   'PetalLengthCm':'petal_lengthcm',
                   'PetalWidthCm':'petal_widthcm',
                   'Species':'species'
                    },inplace=True)

In [22]:
# select the column "Sepal Length" 
# way 1
df['sepal_lengthcm']

#way2
df.sepal_lengthcm

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_lengthcm, Length: 150, dtype: float64

In [23]:
# select the column "Sepal Length"  and "Sepal width"

df[['sepal_lengthcm','sepal_widthcm']]

     sepal_lengthcm  sepal_widthcm
0               5.1            3.5
1               4.9            3.0
2               4.7            3.2
3               4.6            3.1
4               5.0            3.6
..              ...            ...
145             6.7            3.0
146             6.3            2.5
147             6.5            3.0
148             6.2            3.4
149             5.9            3.0

[150 rows x 2 columns]

In [24]:
df = pd.DataFrame([['Tom',15,'Male','middle'],['Alice',10, 'Female','elementary']], columns =['Name','Age','gender','School'])

In [25]:
df

    Name  Age  gender      School
0    Tom   15    Male      middle
1  Alice   10  Female  elementary

In [26]:
# check the index
df.index

RangeIndex(start=0, stop=2, step=1)

In [27]:
# change the index (0: stud1, 1:stud2)
# way 1
df1 =df.copy()
df1.index =['stud1','stud2']
# check the index
print(df1.index )

Index(['stud1', 'stud2'], dtype='object')

In [28]:
# way 2
df2 =df.copy()
df2.rename (index={0:'stud1',
             1:'stud2'}, inplace=True)
# check the index
print(df2.index )

Index(['stud1', 'stud2'], dtype='object')

In [29]:
# way 3
df3 =df.copy()
df3.set_index('Name',inplace=True)
# check the index
df3

       Age  gender      School
Name
Tom     15    Male      middle
Alice   10  Female  elementary

In [30]:
exam_data = {
    "math":[90,80,70],
    "eng":[98,89,95],
    "music":[85,95,100],
    "science":[100,90,90]
}

In [31]:
# transform into dataFrame(index :stud1, stud2, stud3)

df_stud =pd.DataFrame(exam_data, index=['stud1','stud2','stud3'])
df_stud

       math  eng  music  science
stud1    90   98     85      100
stud2    80   89     95       90
stud3    70   95    100       90

In [32]:
# make three copy (df1,df2,df3, df4)
df1 = df_stud.copy()
df2 = df_stud.copy()
df3 = df_stud.copy()
df4= df_stud.copy()

In [33]:
#drop stud2 from df1
df1.drop('stud2',axis=0, inplace=True)
df1

       math  eng  music  science
stud1    90   98     85      100
stud3    70   95    100       90

In [34]:
#drop stud2 and stud3 from df2
df2.drop(['stud2','stud3'],axis=0, inplace=True)
df2

       math  eng  music  science
stud1    90   98     85      100

In [35]:
#drop the columns 'music' from df3
df3.drop('music',axis=1, inplace=True)
df3

       math  eng  science
stud1    90   98      100
stud2    80   89       90
stud3    70   95       90

In [36]:
#drop the columns 'music'  and science from df4

df4.drop(['music','science'],axis=1, inplace=True)
df4

       math  eng
stud1    90   98
stud2    80   89
stud3    70   95

# indexing and slicing

In [37]:
# select the first row using 'iloc'
df_stud.iloc[0]

math        90
eng         98
music       85
science    100
Name: stud1, dtype: int64

In [38]:
df_stud

       math  eng  music  science
stud1    90   98     85      100
stud2    80   89     95       90
stud3    70   95    100       90

In [39]:
# select the first row using 'loc'
df_stud.loc['stud1']

math        90
eng         98
music       85
science    100
Name: stud1, dtype: int64

In [40]:
# select the 'stud1' and 'stud2' using iloc
df_stud.iloc[[0,1]]

       math  eng  music  science
stud1    90   98     85      100
stud2    80   89     95       90

In [41]:
# select the 'stud1' and 'stud2' using loc
df_stud.loc[['stud1','stud2']]

       math  eng  music  science
stud1    90   98     85      100
stud2    80   89     95       90

In [42]:
exam_data = {
    "name":['hongildong','hongeeedong','hongsamdong'],
    "math":[90,80,70],
    "eng":[98,89,95],
    "music":[85,95,100],
    "science":[100,90,90]
}

In [43]:
# transform into dataFrame
df_exam_data = pd.DataFrame(exam_data)
df_exam_data

          name  math  eng  music  science
0   hongildong    90   98     85      100
1  hongeeedong    80   89     95       90
2  hongsamdong    70   95    100       90

In [44]:
# set the column "name" as the new index
df_exam_data.set_index('name',inplace=True)
df_exam_data

             math  eng  music  science
name
hongildong     90   98     85      100
hongeeedong    80   89     95       90
hongsamdong    70   95    100       90

In [45]:
# select music score of hongildong
df_exam_data.iloc[0,2]

85

In [46]:
# select music and science score of hongildong
#using iloc 
print(df_exam_data.iloc[0,[2,3]])
#using loc
print(df_exam_data.loc['hongildong',['music','science']])

music       85
science    100
Name: hongildong, dtype: int64
music       85
science    100
Name: hongildong, dtype: int64

In [47]:
# ### slicing
#select math, eng, music, and science score of hongeeedong
#using iloc 
print(df_exam_data.iloc[1,0:])

math       80
eng        89
music      95
science    90
Name: hongeeedong, dtype: int64

In [48]:
#using loc
print(df_exam_data.loc['hongeeedong','math':'science'])

math       80
eng        89
music      95
science    90
Name: hongeeedong, dtype: int64

In [49]:
#select math, eng, music, and science score of hongeeedong and hongildong
#using iloc 
print(df_exam_data.iloc[0:2,0:])

             math  eng  music  science
name
hongildong     90   98     85      100
hongeeedong    80   89     95       90

In [50]:
#using loc
print(df_exam_data.loc[['hongeeedong','hongildong'],'math':'science'])

             math  eng  music  science
name
hongeeedong    80   89     95       90
hongildong     90   98     85      100

In [51]:
# add a new column
df_exam_data['phy']=[85,70,75]
df_exam_data

             math  eng  music  science  phy
name
hongildong     90   98     85      100   85
hongeeedong    80   89     95       90   70
hongsamdong    70   95    100       90   75

In [52]:
# add a new row
df_exam_data[3]=[]

ValueError: Length of values (0) does not match length of index (3)